sources/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Староста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятВГруппу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдаленИзГруппы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/Catalogs/Студенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	
	ФИО = ОбщиеФункции.РазделитьФИО(Объект.Наименование); 
	Объект.Фамилия = ФИО[0];
	Объект.Имя = ФИО[1];
	Объект.Отчество = ФИО[2];

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиАнализ(Команда)
	
	Анализ = РаботаСАналитикой.ПровестиОбщуюСтатистикуДляСтудента(ПолучениеСтудентаПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 0);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучениеСтудентаПоНаименованию(Наим)

	Возврат Справочники.Студенты.НайтиПоНаименованию(Наим);	

КонецФункции // ПолучениеСтудентаПоНаименованию()


&НаКлиенте
Процедура ПровестиАнализПропусков(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПериод", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПериода",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПериод(Результат, ДопПар) Экспорт

	  Структура = Результат;
	  
	Анализ = РаботаСАналитикой.ПровестиПоискПропусковЗаПериодПоСтуденту(Структура, ПолучениеСтудентаПоНаименованию(Объект.Наименование));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Анализ", Анализ);
	ПараметрыФормы.Вставить("Макет", 1);
	ОткрытьФорму("Обработка.АнализДанных.Форма.Форма", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПринятВГруппу) Тогда
	
		 Объект.ПринятВГруппу = НачалоМесяца(ТекущаяДата());
	
	 КонецЕсли; 
	 
	 Если Не ЗначениеЗаполнено(Объект.УдаленИзГруппы) Тогда
	
		 Объект.УдаленИзГруппы = Дата(2100,1,1);
	
	КонецЕсли;
	
КонецПроцедуры
